Revit 2027 API
ElementBinding Class
A base class for all types of binding that attach to an element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Binding
 Autodesk.Revit.DB.ElementBinding
 Autodesk.Revit.DB.InstanceBinding
 Autodesk.Revit.DB.TypeBinding
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class ElementBinding : Binding
Public MustInherit Class ElementBinding
	Inherits Binding
public ref class ElementBinding abstract : public Binding
[<AbstractClassAttribute>]
type ElementBinding =
    class
        inherit Binding
    end
The ElementBinding type exposes the following members.
Properties
Name | Description
Categories | Retrieve or set the categories to which a parameter definition will be bound.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Top
Methods
Name | Description
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
This base class provides methods that are common to all types of binding that work with elements.
See Also
Reference
Autodesk.Revit.DB Namespace